Revit 2026 API

# CurvePeriod Property

---

The period of this curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Period { get; }
```
```vb
Public ReadOnly Property Period As Double
	Get
```
```cpp
public:
property double Period {
	double get ();
}
```
```fsharp
member Period : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the curve is not cyclic. |

#### Reference

Curve Class

Autodesk.Revit.DB Namespace